### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [261]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
pdata_df = pd.read_csv(file_to_load)
pdata_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [262]:
pdata_df.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

In [263]:
SN1 = len(pdata_df["SN"].unique())
ptable = pd.DataFrame({"Total Players": [SN1]})
ptable

   Total Players
0            576

In [264]:

#pdata_df.append(SNunique)
#pdata_df
#wont let me append this new drop duplicates variable, why?

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [265]:
avg_price = pdata_df["Price"].mean()
avg_price

3.050987179487176

In [266]:
unique_items = len(pdata_df["Item ID"].value_counts())
unique_items

183

In [267]:
purchases = len(pdata_df["Purchase ID"].value_counts())
purchases

780

In [268]:
Total_Revenue = purchases * avg_price
Total_Revenue

2379.7699999999973

In [269]:
P_Analysis = pd.DataFrame({"Number of Unique Items": [unique_items], 
                           "Average Price": [avg_price], 
                           "Number of Purchases": [purchases], 
                           "Total Revenue": [Total_Revenue]})

P_Analysis["Average Price"] = P_Analysis["Average Price"].astype(float).map("${:,.2f}".format)
P_Analysis["Total Revenue"] = P_Analysis["Total Revenue"].astype(float).map("${:,.2f}".format)
P_Analysis

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     183         $3.05                  780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [270]:
#Created female, male, other count variables from the original dataframe
Male = pdata_df.loc[pdata_df["Gender"] == "Male",:]
Male_sum = Male.nunique()
Male_sum

Purchase ID    652
SN             484
Age             39
Gender           1
Item ID        182
Item Name      178
Price          144
dtype: int64

In [271]:
MS1 = Male_sum["SN"].sum()
MS1

484

In [272]:
Other = pdata_df.loc[pdata_df["Gender"] == "Other / Non-Disclosed",:]
Other_sum = Other.nunique()
Other_sum

Purchase ID    15
SN             11
Age             8
Gender          1
Item ID        13
Item Name      13
Price          12
dtype: int64

In [273]:
OS1 = Other_sum["SN"].sum()
OS1

11

In [274]:
Female = pdata_df.loc[pdata_df["Gender"] == "Female",:]
Female_sum = Female.nunique()
Female_sum

Purchase ID    113
SN              81
Age             22
Gender           1
Item ID         90
Item Name       90
Price           79
dtype: int64

In [275]:
FS1 = Female_sum["SN"].sum()
FS1

81

In [276]:
FemalePercent = FS1 / (FS1 + MS1 + OS1)
MalePercent = MS1 / (FS1 + MS1 + OS1)
OtherPercent = OS1 / (FS1 + MS1 + OS1)
#FemalePercent
#MalePercent
#OtherPercent

In [277]:
new_summary = pd.DataFrame({"Total Count": [MS1, FS1, OS1],
                            "Percentage of Players": [MalePercent, FemalePercent, OtherPercent]})
new_summary["Percentage of Players"] = pd.Series(["{0:.2f}%".format(val * 100) for val in new_summary["Percentage of Players"]]) 
new_summary

   Total Count Percentage of Players
0          484                84.03%
1           81                14.06%
2           11                 1.91%

In [278]:
new_summary.rename(index={0:"Male", 1:"Female", 2:"Other / Non-Disclosed"}, inplace=True)
#new_summary.index.names = ["Male", "Female", "Other / Non-Disclosed"]
#new_summary = new_summary.set_index("Male", "Female", "Other")
new_summary

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [279]:
FS2 = Female_sum["Purchase ID"].sum()
OS2 = Other_sum["Purchase ID"].sum()
MS2 = Male_sum["Purchase ID"].sum()

In [280]:
MS3 = Male["Price"].mean()
OS3 = Other["Price"].mean()
FS3 = Female["Price"].mean()

In [281]:
TdollarM = MS2 * MS3
TdollarO = OS2 * OS3
TdollarF = FS2 * FS3

In [282]:
AVG_Total_Male = TdollarM / MS1
AVG_Total_Other = TdollarO / OS1
AVG_Total_Female = TdollarF / FS1

In [283]:
summary3 = pd.DataFrame({"Purchase Count": [MS2, FS2, OS2],"Average Purchase Price": [MS3, FS3, OS3],
                         "Total Purchase Value": [TdollarM, TdollarF, TdollarO], 
                         "Avg Total Purchase per Person": [AVG_Total_Male, AVG_Total_Female, AVG_Total_Other]})
summary3["Average Purchase Price"] = pd.Series(["${0:.2f}".format(val * 1) for val in summary3["Average Purchase Price"]])
summary3["Total Purchase Value"] = pd.Series(["${0:.2f}".format(val * 1) for val in summary3["Total Purchase Value"]])
summary3["Avg Total Purchase per Person"] = pd.Series(["${0:.2f}".format(val * 1) for val in summary3["Avg Total Purchase per Person"]])

summary3

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
0,652,$3.02,$1967.64,$4.07
1,113,$3.20,$361.94,$4.47
2,15,$3.35,$50.19,$4.56

In [284]:
summary3.rename(index={0:"Male", 1:"Female", 2:"Other / Non-Disclosed"}, inplace=True)
summary3.index.name = "Gender"
summary3

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Male,652,$3.02,$1967.64,$4.07
Female,113,$3.20,$361.94,$4.47
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [285]:
#sorted on anything??? doesnt appear to be

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [286]:
age_range = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
bins = [0,9, 14, 19, 24, 29, 34, 39, 44]
pdata_df["Purchase Count"] = pd.cut(pdata_df["Age"], bins, labels = age_range)
counts = pdata_df["Purchase Count"].value_counts()
counts

20-24    365
15-19    136
25-29    101
30-34     73
35-39     41
10-14     28
<10       23
40+       12
Name: Purchase Count, dtype: int64

In [287]:
p2_df = pdata_df
pdatagroup = p2_df.groupby("Purchase Count")
#print(pdatagroup)
pdatagroup.count().head(10)

                Purchase ID   SN  Age  Gender  Item ID  Item Name  Price
Purchase Count
<10                      23   23   23      23       23         23     23
10-14                    28   28   28      28       28         28     28
15-19                   136  136  136     136      136        136    136
20-24                   365  365  365     365      365        365    365
25-29                   101  101  101     101      101        101    101
30-34                    73   73   73      73       73         73     73
35-39                    41   41   41      41       41         41     41
40+                      12   12   12      12       12         12     12

In [288]:
SNuni = pdatagroup["SN"].nunique()
TotalSNuni = SNuni.sum()
SNuni

Purchase Count
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       11
Name: SN, dtype: int64

In [289]:
pp = SNuni / TotalSNuni
pp

Purchase Count
<10      0.029565
10-14    0.038261
15-19    0.186087
20-24    0.448696
25-29    0.133913
30-34    0.090435
35-39    0.053913
40+      0.019130
Name: SN, dtype: float64

In [290]:
#pdatagroup['SN'] = pd.to_numeric(pdatagroup['SN'])
pdatagroup.dtypes

                  Age  Gender Item ID Item Name    Price Purchase ID      SN
Purchase Count
<10             int64  object   int64    object  float64       int64  object
10-14           int64  object   int64    object  float64       int64  object
15-19           int64  object   int64    object  float64       int64  object
20-24           int64  object   int64    object  float64       int64  object
25-29           int64  object   int64    object  float64       int64  object
30-34           int64  object   int64    object  float64       int64  object
35-39           int64  object   int64    object  float64       int64  object
40+             int64  object   int64    object  float64       int64  object

In [291]:
summary4 = pd.DataFrame({"Total Count": SNuni,"Percentage of Players": pp,})
#summary4["Percentage of Players"] = summary4["Percentage of Players"].astype(float).map("{:.2f}%".format)
#summary4["Percentage of Players"] = pd.Series(["{0:.2f}%".format(val * 100) for val in summary4["Percentage of Players"]])
summary4["Percentage of Players"] = summary4["Percentage of Players"].apply(lambda x: "{0:.2f}%".format(x*100))
#why did apply work here, not applymap or map or pd.series above?
summary4.index.name = ""
summary4

       Total Count Percentage of Players

<10             17                 2.96%
10-14           22                 3.83%
15-19          107                18.61%
20-24          258                44.87%
25-29           77                13.39%
30-34           52                 9.04%
35-39           31                 5.39%
40+             11                 1.91%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [292]:
pdatagroup.count().head()

       Purchase ID   SN  Age  Gender  Item ID  Item Name  Price

<10             23   23   23      23       23         23     23
10-14           28   28   28      28       28         28     28
15-19          136  136  136     136      136        136    136
20-24          365  365  365     365      365        365    365
25-29          101  101  101     101      101        101    101

In [293]:
avgpurchaseprice = pdatagroup["Price"].mean()
avgpurchaseprice

<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      3.045000
Name: Price, dtype: float64

In [294]:
Total = avgpurchaseprice * counts
Total

10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        36.54
<10        77.13
dtype: float64

In [295]:
SNuni2 = Total / SNuni
SNuni2

10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.321818
<10      4.537059
dtype: float64

In [296]:
summary5 = pd.DataFrame({"Purchase Count": counts,"Average Purchase Price": avgpurchaseprice,
                         "Total Purchase Price": Total, "Avg. Total Purchase per Person": SNuni2 })
#summary5["Avg. Total Purchase per Person"] = pd.Series(["${0:.2f}".format(val * 1) for val in summary5["Avg. Total Purchase per Person"]])
summary5["Average Purchase Price"] = summary5["Average Purchase Price"].astype(float).map("${:,.2f}".format)
summary5["Total Purchase Price"] = summary5["Total Purchase Price"].astype(float).map("${:,.2f}".format)
summary5["Avg. Total Purchase per Person"] = summary5["Avg. Total Purchase per Person"].astype(float).map("${:,.2f}".format)
summary5

,Purchase Count,Average Purchase Price,Total Purchase Price,Avg. Total Purchase per Person
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,12,$3.04,$36.54,$3.32
<10,23,$3.35,$77.13,$4.54

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [297]:
df = pdata_df
#df = pdatanew_df.set_index("SN")
#df.head()
#dfgroup = df.groupby("SN")
#df = df.set_index("SN")
#dfgroup.count()
#dfgroup.head() why is this not printing properly???
df.head(10)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Purchase Count
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
5,5,Yalae81,22,Male,81,Dreamkiss,3.61,20-24
6,6,Itheria73,36,Male,169,"Interrogator, Blood Blade of the Queen",2.18,35-39
7,7,Iskjaskst81,20,Male,162,Abyssal Shard,2.67,20-24
8,8,Undjask33,22,Male,21,Souleater,1.10,20-24
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58,35-39

In [298]:
# Thought about merging these but didnt work, find out why
#Lisosia93df = df[df.SN == "Lisosia93"]
#IDastidru52df = df[df.SN == "IDastidru52"]
#Chamjask73df = df[df.SN == "Chamjask73"]
#Iral74df = df[df.SN == "Iral74"]
#Iskadarya95df = df[df.SN == "Iskadarya95"]
#Lisosia93df.sum()
#merge_table = pd.merge(Lisosia93df, IDastidru52df, Chamjask73df, Iral74df, Iskadarya95df, on= "SN")
#merge_table

In [299]:
booleans = []
for id in df.SN:
    if id == "Lisosia93":
        booleans.append(True)
    elif id == "Idastidru52":
        booleans.append(True)
    elif id == "Chamjask73":
        booleans.append(True)
    elif id == "Iral74":
        booleans.append(True)
    elif id == "Iskadarya95":
        booleans.append(True)
    else:
        booleans.append(False)


#df=df.loc[[df["SN"] == [["Lisosia93", "Idastidru52", "Chamjask73","Iral74", "Iskadarya95"]], :]
#df.head()

In [300]:
iddata = pd.Series(booleans)
#iddata.head()
df[iddata]

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Purchase Count
74,74,Lisosia93,25,Male,89,"Blazefury, Protector of Delusions",4.64,25-29
120,120,Lisosia93,25,Male,24,Warped Fetish,3.81,25-29
128,128,Iral74,21,Male,58,"Freak's Bite, Favor of Holy Might",4.14,20-24
148,148,Iskadarya95,20,Male,148,"Warmonger, Gift of Suffering's End",4.03,20-24
222,222,Chamjask73,22,Female,178,"Oathbreaker, Last Hope of the Breaking Storm",4.23,20-24
224,224,Lisosia93,25,Male,157,"Spada, Etcher of Hatred",4.80,25-29
247,247,Iskadarya95,20,Male,82,Nirvana,4.90,20-24
290,290,Idastidru52,24,Male,147,"Hellreaver, Heirloom of Inception",4.93,20-24
318,318,Iskadarya95,20,Male,91,Celeste,4.17,20-24
490,490,Idastidru52,24,Male,148,"Warmonger, Gift of Suffering's End",4.03,20-24
520,520,Chamjask73,22,Female,109,"Downfall, Scalpel Of The Emperor",4.76,20-24
543,543,Idastidru52,24,Male,121,Massacre,1.60,20-24
564,564,Chamjask73,22,Female,52,Hatred,4.84,20-24
603,603,Lisosia93,25,Male,141,Persuasion,3.19,25-29
609,609,Lisosia93,25,Male,40,Second Chance,2.52,25-29
623,623,Iral74,21,Male,114,Yearning Mageblade,3.82,20-24
676,676,Idastidru52,24,Male,111,Misery's End,4.89,20-24
758,758,Iral74,21,Male,182,Toothpick,4.03,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24

In [301]:
N1 = df[iddata].loc[df[iddata]["SN"] == "Lisosia93", :]
N1mean = N1["Price"].mean()
N1c = N1["SN"].count()
N1total = N1mean * N1c
N1total

18.96

In [302]:
N2 = df[iddata].loc[df[iddata]["SN"] == "Idastidru52", :]
N2mean = N2["Price"].mean()
N2c = N2["SN"].count()
N2total = N2mean * N2c
N2mean

3.8625

In [303]:
N3 = df[iddata].loc[df[iddata]["SN"] == "Chamjask73", :]
N3mean = N3["Price"].mean()
N3c = N3["SN"].count()
N3total = N3mean * N3c
N3c

3

In [304]:
N4 = df[iddata].loc[df[iddata]["SN"] == "Iral74", :]
N4mean = N4["Price"].mean()
N4c = N4["SN"].count()
N4total = N4mean * N4c
N4c

4

In [305]:
N5 = df[iddata].loc[df[iddata]["SN"] == "Iskadarya95", :]
N5mean = N5["Price"].mean()
N5c = N5["SN"].count()
N5total = N5mean * N5c
N5c

3

In [306]:
summary6 = pd.DataFrame({"Purchase Count": [N1c, N2c, N3c, N4c, N5c], 
                         "Average Purchase Price": [N1mean, N2mean, N3mean, N4mean, N5mean],
                         "Total Purchase Value": [N1total, N2total, N3total, N4total, N5total]})

summary6["Average Purchase Price"] = pd.Series(["${0:.2f}".format(val * 1) for val in summary6["Average Purchase Price"]])
summary6["Total Purchase Value"] = pd.Series(["${0:.2f}".format(val * 1) for val in summary6["Total Purchase Value"]])
summary6.rename(index={0:"Lisosia93", 1:"Idastidru52", 2:"Chamjask73", 3: "Iral74", 4:"Iskadarya95"}, inplace=True)
summary6.index.name = "SN"


summary6

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

In [307]:
#names = df.loc[["Lisosia93", "Idastidru52", "Chamjask73","Iral74", "Iskadarya95"], ["Price"]]
#print(names)
#names
#OnlyLis = dfgroup.loc[dfgroup["SN"] == "Lisosia93", :]
#lmean = Only_Lis["Price"].mean()
#lcount = Only_Lisosia93["SN"].count()
#ltotal = Only_Lisosia93["Price"].mean() * Only_Lisosia93["SN"].count()
#ltotal

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [308]:
new_df = pdata_df
new_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Purchase Count
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [309]:
newer_df = new_df[["Item ID", "Item Name", "Price", "SN"]]
newer_df.head()

   Item ID                                  Item Name  Price             SN
0      108  Extraction, Quickblade Of Trembling Hands   3.53        Lisim78
1      143                          Frenzied Scimitar   1.56    Lisovynya38
2       92                               Final Critic   4.88     Ithergue48
3      100                                Blindscythe   3.27  Chamassasya86
4      131                                       Fury   1.44      Iskosia90

In [310]:
newer_grouped_df = new_df.groupby(['Item ID', 'Item Name'])
newer_grouped_df
ngfmean = newer_grouped_df["Price"].mean()
ngfcount = newer_grouped_df["SN"].count()
ngftotal = ngfmean * ngfcount

In [311]:
#newer_grouped_df.count().head()  CHecked if the groupby worked, it did
summary7 = pd.DataFrame({"Purchase Count": ngfcount, "Item Price": ngfmean, 
                                         "Total Purchase Value": ngftotal})
summary7["Total Purchase Value"] = summary7["Total Purchase Value"].astype(float).map("${:,.2f}".format)
summary7["Item Price"] = summary7["Item Price"].astype(float).map("${:,.2f}".format)
summary7desc = summary7.sort_values("Purchase Count", ascending = False)
summary7desc.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [318]:
summary8 = pd.DataFrame({"Purchase Count": ngfcount, "Item Price": ngfmean, 
                                         "Total Purchase Value": ngftotal})
#summary8["Total Purchase Value"] = summary8["Total Purchase Value"].astype(float).map("${:,.2f}".format)
#summary8["Item Price"] = summary8["Item Price"].astype(float).map("${:,.2f}".format)
#when I go to clean the data, it ends up doing something funky with the data and removing some
summary8desc = summary8.sort_values("Total Purchase Value", ascending = False)
summary8desc.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80